RT-Thread/rt-thread/bsp/stm32/stm32u575-st-nucleo/board/CubeMX_Config/Drivers/STM32U5xx_HAL_Driver/Inc/stm32u5xx_ll_adc.h
#define ADC4_CHANNEL_0_BITFIELD             (ADC_CHSELR_CHSEL0)
#define ADC4_CHANNEL_1_BITFIELD             (ADC_CHSELR_CHSEL1)
#define ADC4_CHANNEL_2_BITFIELD             (ADC_CHSELR_CHSEL2)
#define ADC4_CHANNEL_3_BITFIELD             (ADC_CHSELR_CHSEL3)
#define ADC4_CHANNEL_4_BITFIELD             (ADC_CHSELR_CHSEL4)
#define ADC4_CHANNEL_5_BITFIELD             (ADC_CHSELR_CHSEL5)
#define ADC4_CHANNEL_6_BITFIELD             (ADC_CHSELR_CHSEL6)
#define ADC4_CHANNEL_7_BITFIELD             (ADC_CHSELR_CHSEL7)
#define ADC4_CHANNEL_8_BITFIELD             (ADC_CHSELR_CHSEL8)
#define ADC4_CHANNEL_9_BITFIELD             (ADC_CHSELR_CHSEL9)
#define ADC4_CHANNEL_10_BITFIELD            (ADC_CHSELR_CHSEL10)
#define ADC4_CHANNEL_11_BITFIELD            (ADC_CHSELR_CHSEL11)
#define ADC4_CHANNEL_12_BITFIELD            (ADC_CHSELR_CHSEL12)
#define ADC4_CHANNEL_13_BITFIELD            (ADC_CHSELR_CHSEL13)
#define ADC4_CHANNEL_14_BITFIELD            (ADC_CHSELR_CHSEL14)
#define ADC4_CHANNEL_15_BITFIELD            (ADC_CHSELR_CHSEL15)
#define ADC4_CHANNEL_16_BITFIELD            (ADC_CHSELR_CHSEL16)
#define ADC4_CHANNEL_17_BITFIELD            (ADC_CHSELR_CHSEL17)
#define ADC4_CHANNEL_18_BITFIELD            (ADC_CHSELR_CHSEL18)
#define ADC4_CHANNEL_19_BITFIELD            (ADC_CHSELR_CHSEL19)
#define ADC4_CHANNEL_20_BITFIELD            (ADC_CHSELR_CHSEL20)
#define ADC4_CHANNEL_21_BITFIELD            (ADC_CHSELR_CHSEL21)
#define ADC4_CHANNEL_22_BITFIELD            (ADC_CHSELR_CHSEL22)
#define ADC4_CHANNEL_23_BITFIELD            (ADC_CHSELR_CHSEL23)

/* Definition of channels sampling time information to be inserted into       */
/* channels literals definition.                                              */
#define ADC_CHANNEL_0_SMP    (ADC_SMPR1_REGOFFSET ) /* Channel is with "ADC_SMPR1_SMP0" register  */
#define ADC_CHANNEL_1_SMP    (ADC_SMPR1_REGOFFSET ) /* Channel is with "ADC_SMPR1_SMP1" register  */
#define ADC_CHANNEL_2_SMP    (ADC_SMPR1_REGOFFSET ) /* Channel is with "ADC_SMPR1_SMP2" register  */
#define ADC_CHANNEL_3_SMP    (ADC_SMPR1_REGOFFSET ) /* Channel is with "ADC_SMPR1_SMP3" register  */
#define ADC_CHANNEL_4_SMP    (ADC_SMPR1_REGOFFSET ) /* Channel is with "ADC_SMPR1_SMP4" register  */
#define ADC_CHANNEL_5_SMP    (ADC_SMPR1_REGOFFSET ) /* Channel is with "ADC_SMPR1_SMP5" register  */
#define ADC_CHANNEL_6_SMP    (ADC_SMPR1_REGOFFSET ) /* Channel is with "ADC_SMPR1_SMP6" register  */
#define ADC_CHANNEL_7_SMP    (ADC_SMPR1_REGOFFSET ) /* Channel is with "ADC_SMPR1_SMP7" register  */
#define ADC_CHANNEL_8_SMP    (ADC_SMPR1_REGOFFSET ) /* Channel is with "ADC_SMPR1_SMP8" register  */
#define ADC_CHANNEL_9_SMP    (ADC_SMPR1_REGOFFSET ) /* Channel is with "ADC_SMPR1_SMP9" register  */
#define ADC_CHANNEL_10_SMP   (ADC_SMPR2_REGOFFSET ) /* Channel is with "ADC_SMPR2_SMP10" register */
#define ADC_CHANNEL_11_SMP   (ADC_SMPR2_REGOFFSET ) /* Channel is with "ADC_SMPR2_SMP11" register */
#define ADC_CHANNEL_12_SMP   (ADC_SMPR2_REGOFFSET ) /* Channel is with "ADC_SMPR2_SMP12" register */
#define ADC_CHANNEL_13_SMP   (ADC_SMPR2_REGOFFSET ) /* Channel is with "ADC_SMPR2_SMP13" register */
#define ADC_CHANNEL_14_SMP   (ADC_SMPR2_REGOFFSET ) /* Channel is with "ADC_SMPR2_SMP14" register */
#define ADC_CHANNEL_15_SMP   (ADC_SMPR2_REGOFFSET ) /* Channel is with "ADC_SMPR2_SMP15" register */
#define ADC_CHANNEL_16_SMP   (ADC_SMPR2_REGOFFSET ) /* Channel is with "ADC_SMPR2_SMP16" register */
#define ADC_CHANNEL_17_SMP   (ADC_SMPR2_REGOFFSET ) /* Channel is with "ADC_SMPR2_SMP17" register */
#define ADC_CHANNEL_18_SMP   (ADC_SMPR2_REGOFFSET ) /* Channel is with "ADC_SMPR2_SMP18" register */
#define ADC_CHANNEL_19_SMP   (ADC_SMPR2_REGOFFSET ) /* Channel is with "ADC_SMPR2_SMP19" register */
#define ADC_CHANNEL_20_SMP   (ADC_SMPR2_REGOFFSET ) /* Channel is with "ADC_SMPR2_SMP20" register */
#define ADC_CHANNEL_21_SMP   (ADC_SMPR2_REGOFFSET ) /* Channel is with "ADC_SMPR2_SMP21" register */
#define ADC_CHANNEL_22_SMP   (ADC_SMPR2_REGOFFSET ) /* Channel is with "ADC_SMPR2_SMP22" register */
#define ADC_CHANNEL_23_SMP   (ADC_SMPR2_REGOFFSET ) /* Channel is with "ADC_SMPR2_SMP23" register */

/* Internal mask for ADC mode single or differential ended:                   */
/* To select into literals LL_ADC_SINGLE_ENDED or LL_ADC_SINGLE_DIFFERENTIAL  */
/* the relevant bits for:                                                     */
/* (concatenation of multiple bits used in different registers)               */
/* - ADC calibration: calibration start, calibration factor get or set        */
/* - ADC channels: set each ADC channel ending mode                           */
#define ADC_SINGLEDIFF_CALIB_FACTOR_MASK   (ADC_CALFACT2_CALFACT)
#define ADC_CALFACT2_CALFACT_S   (0x0000FFFFUL)
#define ADC_CALFACT2_CALFACT_D   (0xFFFF0000UL)
#define ADC_SINGLEDIFF_CHANNEL_MASK        (ADC_CHANNEL_ID_BITFIELD_MASK) /* Equivalent to ADC_DIFSEL_DIFSEL          */
#define ADC_SINGLEDIFF_CHANNEL_SHIFT_MASK  (ADC_CALFACT_I_APB_ADDR_4   \
                                            | ADC_CALFACT_I_APB_ADDR_3)  /* Bits chosen to perform of shift when single
                                                                            mode is selected, shift value out of
                                                                            channels bits range. */
#define ADC_SINGLEDIFF_CALIB_F_BIT_D_MASK   (0x00010000UL)   /* Selection of 1 bit to discriminate differential mode:
                                                                mask of bit                                           */
#define ADC_SINGLEDIFF_CALIB_F_BIT_D_POS    (16UL)           /* Selection of 1 bit to discriminate differential mode:
                                                                position of bit                                       */
#define ADC_SINGLEDIFF_CALIB_F_BIT_D_SHIFT4 (ADC_SINGLEDIFF_CALIB_F_BIT_D_POS - 4UL) /* Shift of bit
                                                                                        ADC_SINGLEDIFF_CALIB_F_BIT_D
                                                                                        to position to perform a shift
                                                                                        of 4 ranks */

/* Internal mask for ADC analog watchdog:                                     */
/* To select into literals LL_ADC_AWD_CHANNELx_xxx the relevant bits for:     */
/* (concatenation of multiple bits used in different analog watchdogs,        */
/* (feature of several watchdogs not available on all STM32 families)).       */
/* - analog watchdog 1: monitored channel defined by number,                  */
/*   selection of ADC group (ADC groups regular and-or injected).             */
/* - analog watchdog 2 and 3: monitored channel defined by bitfield, no       */
/*   selection on groups.                                                     */

/* Internal register offset for ADC analog watchdog channel configuration */
#define ADC_AWD_CR1_REGOFFSET          (0x00000000UL)
#define ADC_AWD_CR2_REGOFFSET          (0x01000000UL)
#define ADC_AWD_CR3_REGOFFSET          (0x02000000UL)

/* Register offset gap between AWD1 and AWD2-AWD3 configuration registers */
/* (Set separately as ADC_AWD_CRX_REGOFFSET to spare 32 bits space */
#define ADC_AWD_CR12_REGOFFSETGAP_MASK (ADC_AWD2CR_AWD2CH_0)
#define ADC_AWD_CR12_REGOFFSETGAP_VAL  (0x00000024UL)

#define ADC_AWD_CRX_REGOFFSET_MASK     (ADC_AWD_CR1_REGOFFSET | ADC_AWD_CR2_REGOFFSET | ADC_AWD_CR3_REGOFFSET)

