RT-Thread/rt-thread/bsp/stm32/stm32u575-st-nucleo/board/CubeMX_Config/Drivers/STM32U5xx_HAL_Driver/Inc/stm32u5xx_ll_adc.h
#define ADC_AWD_CR1_CHANNEL_MASK       (ADC_CFGR1_AWD1CH | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)
#define ADC_AWD_CHANNEL_MASK           (ADC_CHANNEL_ID_NUMBER_MASK)
#define ADC_AWD_CR23_CHANNEL_MASK      (ADC_AWD2CR_AWD2CH)
#define ADC_AWD_CR_ALL_CHANNEL_MASK    (ADC_AWD_CR1_CHANNEL_MASK | ADC_AWD_CR23_CHANNEL_MASK)

#define ADC_AWD_CRX_REGOFFSET_POS      (24UL) /* Position of bits ADC_AWD_CRx_REGOFFSET in ADC_AWD_CRX_REGOFFSET_MASK*/

/* Internal register offset for ADC analog watchdog threshold configuration */
#define ADC_AWD_TR1_REGOFFSET          (ADC_AWD_CR1_REGOFFSET)
#define ADC_AWD_TR2_REGOFFSET          (ADC_AWD_CR2_REGOFFSET)
#define ADC_AWD_TR3_REGOFFSET          (ADC_AWD_CR3_REGOFFSET)
#define ADC_AWD_TRX_REGOFFSET_MASK     (ADC_AWD_TR1_REGOFFSET | ADC_AWD_TR2_REGOFFSET | ADC_AWD_TR3_REGOFFSET)
#define ADC_AWD_TRX_REGOFFSET_POS      (ADC_AWD_CRX_REGOFFSET_POS)   /* Position of bits ADC_TRx_REGOFFSET in
                                                                        ADC_AWD_TRX_REGOFFSET_MASK                   */

#define ADC_AWD_TRX_BIT_HIGH_MASK      (0x00010000UL)                   /* Selection of 1 bit to discriminate
                                                                           threshold high: mask of bit               */
#define ADC_AWD_TRX_BIT_HIGH_POS       (16UL)                           /* Selection of 1 bit to discriminate
                                                                           threshold high: position of bit           */
#define ADC_AWD_TRX_BIT_HIGH_SHIFT4    (ADC_AWD_TRX_BIT_HIGH_POS - 4UL) /* Shift of bit ADC_AWD_TRX_BIT_HIGH
                                                                           to position to perform a shift of 4 ranks */
#define ADC_AWD_TRX_REGOFFSET_BITOFFSET_POS (20UL)

/* Register offset gap between AWD1 and AWD2-AWD3 thresholds registers */
/* (Set separately as ADC_AWD_TRX_REGOFFSET to spare 32 bits space */
#define ADC_AWD_TR12_REGOFFSETGAP_MASK     (ADC_AWD2CR_AWD2CH_0)
#define ADC_AWD_TR12_REGOFFSETGAP_VAL      (0x00000022UL)

/* Legacy literals */
#define LL_ADC_AWD1_TR                      LL_ADC_AWD1
#define LL_ADC_AWD2_TR                      LL_ADC_AWD2
#define LL_ADC_AWD3_TR                      LL_ADC_AWD3

/* Internal mask for ADC offset:                                              */
/* Internal register offset for ADC offset number configuration */
#define ADC_OFR1_REGOFFSET                 (0x00000000UL)
#define ADC_OFR2_REGOFFSET                 (0x00000001UL)
#define ADC_OFR3_REGOFFSET                 (0x00000002UL)
#define ADC_OFR4_REGOFFSET                 (0x00000003UL)
#define ADC_OFRx_REGOFFSET_MASK            (ADC_OFR1_REGOFFSET\
                                            | ADC_OFR2_REGOFFSET | ADC_OFR3_REGOFFSET | ADC_OFR4_REGOFFSET)

/* ADC registers bits positions */
#define ADC_CFGR_RES_BITOFFSET_POS     (ADC_CFGR1_RES_Pos)
#define ADC_CFGR_AWD1SGL_BITOFFSET_POS (ADC_CFGR1_AWD1SGL_Pos)
#define ADC_CFGR_AWD1EN_BITOFFSET_POS  (ADC_CFGR1_AWD1EN_Pos)
#define ADC_CFGR_JAWD1EN_BITOFFSET_POS (ADC_CFGR1_JAWD1EN_Pos)

/* ADC registers bits groups */
#define ADC_CR_BITS_PROPERTY_RS     ( ADC_CR_ADCAL | ADC_CR_JADSTP | ADC_CR_ADSTP | ADC_CR_JADSTART | ADC_CR_ADSTART \
                                      | ADC_CR_ADDIS | ADC_CR_ADEN) /* ADC register CR bits with HW property "rs":
                                                                       Software can read as well as set this bit.
                                                                       Writing '0' has no effect on the bit value. */

/* ADC internal channels related definitions */
/* Internal voltage reference VrefInt */
#define VREFINT_CAL_ADDR            ((uint16_t*) (0x0BFA07A5UL)) /* Internal voltage reference, address of parameter
                                                                    VREFINT_CAL: VrefInt ADC raw data acquired at
                                                                    temperature 30 DegC (tolerance: +-5 DegC),
                                                                    Vref+ = 3.0 V (tolerance: +-10 mV).              */
#define VREFINT_CAL_VREF            (3000UL)                     /* Analog voltage reference (Vref+) value with which
                                                                    VrefInt has been calibrated in production
                                                                    (tolerance: +-10 mV) (unit: mV).      */
/* Temperature sensor */
#define TEMPSENSOR_CAL1_ADDR        ((uint16_t*) (0x0BFA0710UL)) /* Internal temperature sensor, address of parameter
                                                                    TS_CAL1: On STM32U5, temperature sensor ADC raw
                                                                             data acquired at temperature  30 DegC
                                                                             (tolerance: +-5 DegC),Vref+ = 3.0 V
                                                                             (tolerance: +-10 mV).                   */
#define TEMPSENSOR_CAL2_ADDR        ((uint16_t*) (0x0BFA0742UL)) /* Internal temperature sensor, address of parameter
                                                                    TS_CAL2: On STM32U5, temperature sensor ADC raw
                                                                             data acquired at temperature 110 DegC
                                                                             (tolerance: +-5 DegC), Vref+ = 3.0 V
                                                                             (tolerance: +-10 mV).                   */
#define TEMPSENSOR_CAL1_TEMP        (30L)                        /* Internal temperature sensor, temperature at which
                                                                    temperature sensor has been calibrated in
                                                                    production for data into TEMPSENSOR_CAL1_ADDR
                                                                    (tolerance: +-5 DegC) (unit: DegC).              */
#define TEMPSENSOR_CAL2_TEMP        (130L)                       /* Internal temperature sensor, temperature at which
                                                                    temperature sensor has been calibrated in
                                                                    production for data into TEMPSENSOR_CAL2_ADDR
                                                                    (tolerance: +-5 DegC) (unit: DegC).             */
#define TEMPSENSOR_CAL_VREFANALOG   (3000UL)                     /* Analog voltage reference (Vref+) voltage with
                                                                    which temperature sensor has been calibrated in
                                                                    production (+-10 mV) (unit: mV).                */

/**
  * @}
  */

